       01 LN-SQLMSG.
            02 LN-MSG-1                   PIC X(80).
            02 LN-MSG-2                   PIC X(80).
            02 LN-MSG-3                   PIC X(80).
            02 LN-MSG-4                   PIC X(80).
            