      *> Ce fichier est un copybook contant les données qui seront
      *> utilisés dans mes programmes après un linkage
      *> cela me permet de ne pas avoir à les réécrire
      
       01 TEST-CONTEXT.
           02 TESTS-RUN     PIC 9(2) VALUE ZEROES.
           02 PASSES       PIC 9(2) VALUE ZEROES.
           02 FAILURES    PIC 9(2) VALUE ZEROES.
           